artillery.yml
config:
  target: 'http://ec2-18-217-241-71.us-east-2.compute.amazonaws.com:3001'
  phases:
    - duration: 60
      arrivalRate: 1000
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/api/listing/{{$randomNumber(1,9999999)}}/photos"